Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_twis.h
/* -------- TWIS_RHR : (TWIS Offset: 0x0C) (R/  32) Receive Holding Register -------- */
#define TWIS_RHR_OFFSET             0x0C         /**< \brief (TWIS_RHR offset) Receive Holding Register */
#define TWIS_RHR_RESETVALUE         0x00000000   /**< \brief (TWIS_RHR reset_value) Receive Holding Register */

#define TWIS_RHR_RXDATA_Pos         0            /**< \brief (TWIS_RHR) Received Data Byte */
#define TWIS_RHR_RXDATA_Msk         (0xFFu << TWIS_RHR_RXDATA_Pos)
#define TWIS_RHR_RXDATA(value)      ((TWIS_RHR_RXDATA_Msk & ((value) << TWIS_RHR_RXDATA_Pos)))
#define TWIS_RHR_MASK               0x000000FFu  /**< \brief (TWIS_RHR) MASK Register */

/* -------- TWIS_THR : (TWIS Offset: 0x10) ( /W 32) Transmit Holding Register -------- */
#define TWIS_THR_OFFSET             0x10         /**< \brief (TWIS_THR offset) Transmit Holding Register */
#define TWIS_THR_RESETVALUE         0x00000000   /**< \brief (TWIS_THR reset_value) Transmit Holding Register */

#define TWIS_THR_TXDATA_Pos         0            /**< \brief (TWIS_THR) Data Byte to Transmit */
#define TWIS_THR_TXDATA_Msk         (0xFFu << TWIS_THR_TXDATA_Pos)
#define TWIS_THR_TXDATA(value)      ((TWIS_THR_TXDATA_Msk & ((value) << TWIS_THR_TXDATA_Pos)))
#define TWIS_THR_MASK               0x000000FFu  /**< \brief (TWIS_THR) MASK Register */

/* -------- TWIS_PECR : (TWIS Offset: 0x14) (R/  32) Packet Error Check Register -------- */
#define TWIS_PECR_OFFSET            0x14         /**< \brief (TWIS_PECR offset) Packet Error Check Register */
#define TWIS_PECR_RESETVALUE        0x00000000   /**< \brief (TWIS_PECR reset_value) Packet Error Check Register */

#define TWIS_PECR_PEC_Pos           0            /**< \brief (TWIS_PECR) Calculated PEC Value */
#define TWIS_PECR_PEC_Msk           (0xFFu << TWIS_PECR_PEC_Pos)
#define TWIS_PECR_PEC(value)        ((TWIS_PECR_PEC_Msk & ((value) << TWIS_PECR_PEC_Pos)))
#define TWIS_PECR_MASK              0x000000FFu  /**< \brief (TWIS_PECR) MASK Register */

/* -------- TWIS_SR : (TWIS Offset: 0x18) (R/  32) Status Register -------- */
#define TWIS_SR_OFFSET              0x18         /**< \brief (TWIS_SR offset) Status Register */
#define TWIS_SR_RESETVALUE          0x00000002   /**< \brief (TWIS_SR reset_value) Status Register */

#define TWIS_SR_RXRDY_Pos           0            /**< \brief (TWIS_SR) RX Buffer Ready */
#define TWIS_SR_RXRDY               (0x1u << TWIS_SR_RXRDY_Pos)
#define TWIS_SR_TXRDY_Pos           1            /**< \brief (TWIS_SR) TX Buffer Ready */
#define TWIS_SR_TXRDY               (0x1u << TWIS_SR_TXRDY_Pos)
#define TWIS_SR_SEN_Pos             2            /**< \brief (TWIS_SR) Slave Enabled */
#define TWIS_SR_SEN                 (0x1u << TWIS_SR_SEN_Pos)
#define TWIS_SR_TCOMP_Pos           3            /**< \brief (TWIS_SR) Transmission Complete */
#define TWIS_SR_TCOMP               (0x1u << TWIS_SR_TCOMP_Pos)
#define TWIS_SR_TRA_Pos             5            /**< \brief (TWIS_SR) Transmitter Mode */
#define TWIS_SR_TRA                 (0x1u << TWIS_SR_TRA_Pos)
#define TWIS_SR_URUN_Pos            6            /**< \brief (TWIS_SR) Underrun */
#define TWIS_SR_URUN                (0x1u << TWIS_SR_URUN_Pos)
#define TWIS_SR_ORUN_Pos            7            /**< \brief (TWIS_SR) Overrun */
#define TWIS_SR_ORUN                (0x1u << TWIS_SR_ORUN_Pos)
#define TWIS_SR_NAK_Pos             8            /**< \brief (TWIS_SR) NAK Received */
#define TWIS_SR_NAK                 (0x1u << TWIS_SR_NAK_Pos)
#define TWIS_SR_SMBTOUT_Pos         12           /**< \brief (TWIS_SR) SMBus Timeout */
#define TWIS_SR_SMBTOUT             (0x1u << TWIS_SR_SMBTOUT_Pos)
#define TWIS_SR_SMBPECERR_Pos       13           /**< \brief (TWIS_SR) SMBus PEC Error */
#define TWIS_SR_SMBPECERR           (0x1u << TWIS_SR_SMBPECERR_Pos)
#define TWIS_SR_BUSERR_Pos          14           /**< \brief (TWIS_SR) Bus Error */
#define TWIS_SR_BUSERR              (0x1u << TWIS_SR_BUSERR_Pos)
#define TWIS_SR_SAM_Pos             16           /**< \brief (TWIS_SR) Slave Address Match */
#define TWIS_SR_SAM                 (0x1u << TWIS_SR_SAM_Pos)
#define TWIS_SR_GCM_Pos             17           /**< \brief (TWIS_SR) General Call Match */
#define TWIS_SR_GCM                 (0x1u << TWIS_SR_GCM_Pos)
#define TWIS_SR_SMBALERTM_Pos       18           /**< \brief (TWIS_SR) SMBus Alert Response Address Match */
#define TWIS_SR_SMBALERTM           (0x1u << TWIS_SR_SMBALERTM_Pos)
#define TWIS_SR_SMBHHM_Pos          19           /**< \brief (TWIS_SR) SMBus Host Header Address Match */
#define TWIS_SR_SMBHHM              (0x1u << TWIS_SR_SMBHHM_Pos)
#define TWIS_SR_SMBDAM_Pos          20           /**< \brief (TWIS_SR) SMBus Default Address Match */
#define TWIS_SR_SMBDAM              (0x1u << TWIS_SR_SMBDAM_Pos)
#define TWIS_SR_STO_Pos             21           /**< \brief (TWIS_SR) Stop Received */
#define TWIS_SR_STO                 (0x1u << TWIS_SR_STO_Pos)
#define TWIS_SR_REP_Pos             22           /**< \brief (TWIS_SR) Repeated Start Received */
#define TWIS_SR_REP                 (0x1u << TWIS_SR_REP_Pos)
#define TWIS_SR_BTF_Pos             23           /**< \brief (TWIS_SR) Byte Transfer Finished */
#define TWIS_SR_BTF                 (0x1u << TWIS_SR_BTF_Pos)
#define TWIS_SR_MASK                0x00FF71EFu  /**< \brief (TWIS_SR) MASK Register */

/* -------- TWIS_IER : (TWIS Offset: 0x1C) ( /W 32) Interrupt Enable Register -------- */
#define TWIS_IER_OFFSET             0x1C         /**< \brief (TWIS_IER offset) Interrupt Enable Register */
#define TWIS_IER_RESETVALUE         0x00000000   /**< \brief (TWIS_IER reset_value) Interrupt Enable Register */

#define TWIS_IER_RXRDY_Pos          0            /**< \brief (TWIS_IER) RX Buffer Ready */
#define TWIS_IER_RXRDY              (0x1u << TWIS_IER_RXRDY_Pos)
#define TWIS_IER_TXRDY_Pos          1            /**< \brief (TWIS_IER) TX Buffer Ready */
#define TWIS_IER_TXRDY              (0x1u << TWIS_IER_TXRDY_Pos)
#define TWIS_IER_TCOMP_Pos          3            /**< \brief (TWIS_IER) Transmission Complete */
#define TWIS_IER_TCOMP              (0x1u << TWIS_IER_TCOMP_Pos)
#define TWIS_IER_URUN_Pos           6            /**< \brief (TWIS_IER) Underrun */
#define TWIS_IER_URUN               (0x1u << TWIS_IER_URUN_Pos)
#define TWIS_IER_ORUN_Pos           7            /**< \brief (TWIS_IER) Overrun */
#define TWIS_IER_ORUN               (0x1u << TWIS_IER_ORUN_Pos)
#define TWIS_IER_NAK_Pos            8            /**< \brief (TWIS_IER) NAK Received */
#define TWIS_IER_NAK                (0x1u << TWIS_IER_NAK_Pos)
#define TWIS_IER_SMBTOUT_Pos        12           /**< \brief (TWIS_IER) SMBus Timeout */
#define TWIS_IER_SMBTOUT            (0x1u << TWIS_IER_SMBTOUT_Pos)
#define TWIS_IER_SMBPECERR_Pos      13           /**< \brief (TWIS_IER) SMBus PEC Error */
#define TWIS_IER_SMBPECERR          (0x1u << TWIS_IER_SMBPECERR_Pos)
#define TWIS_IER_BUSERR_Pos         14           /**< \brief (TWIS_IER) Bus Error */
#define TWIS_IER_BUSERR             (0x1u << TWIS_IER_BUSERR_Pos)
#define TWIS_IER_SAM_Pos            16           /**< \brief (TWIS_IER) Slave Address Match */
#define TWIS_IER_SAM                (0x1u << TWIS_IER_SAM_Pos)
#define TWIS_IER_GCM_Pos            17           /**< \brief (TWIS_IER) General Call Match */
#define TWIS_IER_GCM                (0x1u << TWIS_IER_GCM_Pos)
#define TWIS_IER_SMBALERTM_Pos      18           /**< \brief (TWIS_IER) SMBus Alert Response Address Match */
#define TWIS_IER_SMBALERTM          (0x1u << TWIS_IER_SMBALERTM_Pos)
#define TWIS_IER_SMBHHM_Pos         19           /**< \brief (TWIS_IER) SMBus Host Header Address Match */
#define TWIS_IER_SMBHHM             (0x1u << TWIS_IER_SMBHHM_Pos)
#define TWIS_IER_SMBDAM_Pos         20           /**< \brief (TWIS_IER) SMBus Default Address Match */
#define TWIS_IER_SMBDAM             (0x1u << TWIS_IER_SMBDAM_Pos)
#define TWIS_IER_STO_Pos            21           /**< \brief (TWIS_IER) Stop Received */
#define TWIS_IER_STO                (0x1u << TWIS_IER_STO_Pos)
#define TWIS_IER_REP_Pos            22           /**< \brief (TWIS_IER) Repeated Start Received */
#define TWIS_IER_REP                (0x1u << TWIS_IER_REP_Pos)
#define TWIS_IER_BTF_Pos            23           /**< \brief (TWIS_IER) Byte Transfer Finished */
#define TWIS_IER_BTF                (0x1u << TWIS_IER_BTF_Pos)
#define TWIS_IER_MASK               0x00FF71CBu  /**< \brief (TWIS_IER) MASK Register */

/* -------- TWIS_IDR : (TWIS Offset: 0x20) ( /W 32) Interrupt Disable Register -------- */
#define TWIS_IDR_OFFSET             0x20         /**< \brief (TWIS_IDR offset) Interrupt Disable Register */
#define TWIS_IDR_RESETVALUE         0x00000000   /**< \brief (TWIS_IDR reset_value) Interrupt Disable Register */

