Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_twis.h
#define TWIS_IDR_RXRDY_Pos          0            /**< \brief (TWIS_IDR) RX Buffer Ready */
#define TWIS_IDR_RXRDY              (0x1u << TWIS_IDR_RXRDY_Pos)
#define TWIS_IDR_TXRDY_Pos          1            /**< \brief (TWIS_IDR) TX Buffer Ready */
#define TWIS_IDR_TXRDY              (0x1u << TWIS_IDR_TXRDY_Pos)
#define TWIS_IDR_TCOMP_Pos          3            /**< \brief (TWIS_IDR) Transmission Complete */
#define TWIS_IDR_TCOMP              (0x1u << TWIS_IDR_TCOMP_Pos)
#define TWIS_IDR_URUN_Pos           6            /**< \brief (TWIS_IDR) Underrun */
#define TWIS_IDR_URUN               (0x1u << TWIS_IDR_URUN_Pos)
#define TWIS_IDR_ORUN_Pos           7            /**< \brief (TWIS_IDR) Overrun */
#define TWIS_IDR_ORUN               (0x1u << TWIS_IDR_ORUN_Pos)
#define TWIS_IDR_NAK_Pos            8            /**< \brief (TWIS_IDR) NAK Received */
#define TWIS_IDR_NAK                (0x1u << TWIS_IDR_NAK_Pos)
#define TWIS_IDR_SMBTOUT_Pos        12           /**< \brief (TWIS_IDR) SMBus Timeout */
#define TWIS_IDR_SMBTOUT            (0x1u << TWIS_IDR_SMBTOUT_Pos)
#define TWIS_IDR_SMBPECERR_Pos      13           /**< \brief (TWIS_IDR) SMBus PEC Error */
#define TWIS_IDR_SMBPECERR          (0x1u << TWIS_IDR_SMBPECERR_Pos)
#define TWIS_IDR_BUSERR_Pos         14           /**< \brief (TWIS_IDR) Bus Error */
#define TWIS_IDR_BUSERR             (0x1u << TWIS_IDR_BUSERR_Pos)
#define TWIS_IDR_SAM_Pos            16           /**< \brief (TWIS_IDR) Slave Address Match */
#define TWIS_IDR_SAM                (0x1u << TWIS_IDR_SAM_Pos)
#define TWIS_IDR_GCM_Pos            17           /**< \brief (TWIS_IDR) General Call Match */
#define TWIS_IDR_GCM                (0x1u << TWIS_IDR_GCM_Pos)
#define TWIS_IDR_SMBALERTM_Pos      18           /**< \brief (TWIS_IDR) SMBus Alert Response Address Match */
#define TWIS_IDR_SMBALERTM          (0x1u << TWIS_IDR_SMBALERTM_Pos)
#define TWIS_IDR_SMBHHM_Pos         19           /**< \brief (TWIS_IDR) SMBus Host Header Address Match */
#define TWIS_IDR_SMBHHM             (0x1u << TWIS_IDR_SMBHHM_Pos)
#define TWIS_IDR_SMBDAM_Pos         20           /**< \brief (TWIS_IDR) SMBus Default Address Match */
#define TWIS_IDR_SMBDAM             (0x1u << TWIS_IDR_SMBDAM_Pos)
#define TWIS_IDR_STO_Pos            21           /**< \brief (TWIS_IDR) Stop Received */
#define TWIS_IDR_STO                (0x1u << TWIS_IDR_STO_Pos)
#define TWIS_IDR_REP_Pos            22           /**< \brief (TWIS_IDR) Repeated Start Received */
#define TWIS_IDR_REP                (0x1u << TWIS_IDR_REP_Pos)
#define TWIS_IDR_BTF_Pos            23           /**< \brief (TWIS_IDR) Byte Transfer Finished */
#define TWIS_IDR_BTF                (0x1u << TWIS_IDR_BTF_Pos)
#define TWIS_IDR_MASK               0x00FF71CBu  /**< \brief (TWIS_IDR) MASK Register */

/* -------- TWIS_IMR : (TWIS Offset: 0x24) (R/  32) Interrupt Mask Register -------- */
#define TWIS_IMR_OFFSET             0x24         /**< \brief (TWIS_IMR offset) Interrupt Mask Register */
#define TWIS_IMR_RESETVALUE         0x00000000   /**< \brief (TWIS_IMR reset_value) Interrupt Mask Register */

#define TWIS_IMR_RXRDY_Pos          0            /**< \brief (TWIS_IMR) RX Buffer Ready */
#define TWIS_IMR_RXRDY              (0x1u << TWIS_IMR_RXRDY_Pos)
#define TWIS_IMR_TXRDY_Pos          1            /**< \brief (TWIS_IMR) TX Buffer Ready */
#define TWIS_IMR_TXRDY              (0x1u << TWIS_IMR_TXRDY_Pos)
#define TWIS_IMR_TCOMP_Pos          3            /**< \brief (TWIS_IMR) Transmission Complete */
#define TWIS_IMR_TCOMP              (0x1u << TWIS_IMR_TCOMP_Pos)
#define TWIS_IMR_URUN_Pos           6            /**< \brief (TWIS_IMR) Underrun */
#define TWIS_IMR_URUN               (0x1u << TWIS_IMR_URUN_Pos)
#define TWIS_IMR_ORUN_Pos           7            /**< \brief (TWIS_IMR) Overrun */
#define TWIS_IMR_ORUN               (0x1u << TWIS_IMR_ORUN_Pos)
#define TWIS_IMR_NAK_Pos            8            /**< \brief (TWIS_IMR) NAK Received */
#define TWIS_IMR_NAK                (0x1u << TWIS_IMR_NAK_Pos)
#define TWIS_IMR_SMBTOUT_Pos        12           /**< \brief (TWIS_IMR) SMBus Timeout */
#define TWIS_IMR_SMBTOUT            (0x1u << TWIS_IMR_SMBTOUT_Pos)
#define TWIS_IMR_SMBPECERR_Pos      13           /**< \brief (TWIS_IMR) SMBus PEC Error */
#define TWIS_IMR_SMBPECERR          (0x1u << TWIS_IMR_SMBPECERR_Pos)
#define TWIS_IMR_BUSERR_Pos         14           /**< \brief (TWIS_IMR) Bus Error */
#define TWIS_IMR_BUSERR             (0x1u << TWIS_IMR_BUSERR_Pos)
#define TWIS_IMR_SAM_Pos            16           /**< \brief (TWIS_IMR) Slave Address Match */
#define TWIS_IMR_SAM                (0x1u << TWIS_IMR_SAM_Pos)
#define TWIS_IMR_GCM_Pos            17           /**< \brief (TWIS_IMR) General Call Match */
#define TWIS_IMR_GCM                (0x1u << TWIS_IMR_GCM_Pos)
#define TWIS_IMR_SMBALERTM_Pos      18           /**< \brief (TWIS_IMR) SMBus Alert Response Address Match */
#define TWIS_IMR_SMBALERTM          (0x1u << TWIS_IMR_SMBALERTM_Pos)
#define TWIS_IMR_SMBHHM_Pos         19           /**< \brief (TWIS_IMR) SMBus Host Header Address Match */
#define TWIS_IMR_SMBHHM             (0x1u << TWIS_IMR_SMBHHM_Pos)
#define TWIS_IMR_SMBDAM_Pos         20           /**< \brief (TWIS_IMR) SMBus Default Address Match */
#define TWIS_IMR_SMBDAM             (0x1u << TWIS_IMR_SMBDAM_Pos)
#define TWIS_IMR_STO_Pos            21           /**< \brief (TWIS_IMR) Stop Received */
#define TWIS_IMR_STO                (0x1u << TWIS_IMR_STO_Pos)
#define TWIS_IMR_REP_Pos            22           /**< \brief (TWIS_IMR) Repeated Start Received */
#define TWIS_IMR_REP                (0x1u << TWIS_IMR_REP_Pos)
#define TWIS_IMR_BTF_Pos            23           /**< \brief (TWIS_IMR) Byte Transfer Finished */
#define TWIS_IMR_BTF                (0x1u << TWIS_IMR_BTF_Pos)
#define TWIS_IMR_MASK               0x00FF71CBu  /**< \brief (TWIS_IMR) MASK Register */

/* -------- TWIS_SCR : (TWIS Offset: 0x28) ( /W 32) Status Clear Register -------- */
#define TWIS_SCR_OFFSET             0x28         /**< \brief (TWIS_SCR offset) Status Clear Register */
#define TWIS_SCR_RESETVALUE         0x00000000   /**< \brief (TWIS_SCR reset_value) Status Clear Register */

#define TWIS_SCR_TCOMP_Pos          3            /**< \brief (TWIS_SCR) Transmission Complete */
#define TWIS_SCR_TCOMP              (0x1u << TWIS_SCR_TCOMP_Pos)
#define TWIS_SCR_URUN_Pos           6            /**< \brief (TWIS_SCR) Underrun */
#define TWIS_SCR_URUN               (0x1u << TWIS_SCR_URUN_Pos)
#define TWIS_SCR_ORUN_Pos           7            /**< \brief (TWIS_SCR) Overrun */
#define TWIS_SCR_ORUN               (0x1u << TWIS_SCR_ORUN_Pos)
#define TWIS_SCR_NAK_Pos            8            /**< \brief (TWIS_SCR) NAK Received */
#define TWIS_SCR_NAK                (0x1u << TWIS_SCR_NAK_Pos)
#define TWIS_SCR_SMBTOUT_Pos        12           /**< \brief (TWIS_SCR) SMBus Timeout */
#define TWIS_SCR_SMBTOUT            (0x1u << TWIS_SCR_SMBTOUT_Pos)
#define TWIS_SCR_SMBPECERR_Pos      13           /**< \brief (TWIS_SCR) SMBus PEC Error */
#define TWIS_SCR_SMBPECERR          (0x1u << TWIS_SCR_SMBPECERR_Pos)
#define TWIS_SCR_BUSERR_Pos         14           /**< \brief (TWIS_SCR) Bus Error */
#define TWIS_SCR_BUSERR             (0x1u << TWIS_SCR_BUSERR_Pos)
#define TWIS_SCR_SAM_Pos            16           /**< \brief (TWIS_SCR) Slave Address Match */
#define TWIS_SCR_SAM                (0x1u << TWIS_SCR_SAM_Pos)
#define TWIS_SCR_GCM_Pos            17           /**< \brief (TWIS_SCR) General Call Match */
#define TWIS_SCR_GCM                (0x1u << TWIS_SCR_GCM_Pos)
#define TWIS_SCR_SMBALERTM_Pos      18           /**< \brief (TWIS_SCR) SMBus Alert Response Address Match */
#define TWIS_SCR_SMBALERTM          (0x1u << TWIS_SCR_SMBALERTM_Pos)
#define TWIS_SCR_SMBHHM_Pos         19           /**< \brief (TWIS_SCR) SMBus Host Header Address Match */
#define TWIS_SCR_SMBHHM             (0x1u << TWIS_SCR_SMBHHM_Pos)
#define TWIS_SCR_SMBDAM_Pos         20           /**< \brief (TWIS_SCR) SMBus Default Address Match */
#define TWIS_SCR_SMBDAM             (0x1u << TWIS_SCR_SMBDAM_Pos)
#define TWIS_SCR_STO_Pos            21           /**< \brief (TWIS_SCR) Stop Received */
#define TWIS_SCR_STO                (0x1u << TWIS_SCR_STO_Pos)
#define TWIS_SCR_REP_Pos            22           /**< \brief (TWIS_SCR) Repeated Start Received */
#define TWIS_SCR_REP                (0x1u << TWIS_SCR_REP_Pos)
#define TWIS_SCR_BTF_Pos            23           /**< \brief (TWIS_SCR) Byte Transfer Finished */
#define TWIS_SCR_BTF                (0x1u << TWIS_SCR_BTF_Pos)
#define TWIS_SCR_MASK               0x00FF71C8u  /**< \brief (TWIS_SCR) MASK Register */

