Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_twis.h
/* -------- TWIS_PR : (TWIS Offset: 0x2C) (R/  32) Parameter Register -------- */
#define TWIS_PR_OFFSET              0x2C         /**< \brief (TWIS_PR offset) Parameter Register */
#define TWIS_PR_RESETVALUE          0x00000001   /**< \brief (TWIS_PR reset_value) Parameter Register */

#define TWIS_PR_HS_Pos              0            /**< \brief (TWIS_PR) HS-mode */
#define TWIS_PR_HS                  (0x1u << TWIS_PR_HS_Pos)
#define TWIS_PR_MASK                0x00000001u  /**< \brief (TWIS_PR) MASK Register */

/* -------- TWIS_VR : (TWIS Offset: 0x30) (R/  32) Version Register -------- */
#define TWIS_VR_OFFSET              0x30         /**< \brief (TWIS_VR offset) Version Register */
#define TWIS_VR_RESETVALUE          0x00000140   /**< \brief (TWIS_VR reset_value) Version Register */

#define TWIS_VR_VERSION_Pos         0            /**< \brief (TWIS_VR) Version Number */
#define TWIS_VR_VERSION_Msk         (0xFFFu << TWIS_VR_VERSION_Pos)
#define TWIS_VR_VERSION(value)      ((TWIS_VR_VERSION_Msk & ((value) << TWIS_VR_VERSION_Pos)))
#define TWIS_VR_VARIANT_Pos         16           /**< \brief (TWIS_VR) Variant Number */
#define TWIS_VR_VARIANT_Msk         (0xFu << TWIS_VR_VARIANT_Pos)
#define TWIS_VR_VARIANT(value)      ((TWIS_VR_VARIANT_Msk & ((value) << TWIS_VR_VARIANT_Pos)))
#define TWIS_VR_MASK                0x000F0FFFu  /**< \brief (TWIS_VR) MASK Register */

/* -------- TWIS_HSTR : (TWIS Offset: 0x34) (R/W 32) HS-mode Timing Register -------- */
#define TWIS_HSTR_OFFSET            0x34         /**< \brief (TWIS_HSTR offset) HS-mode Timing Register */
#define TWIS_HSTR_RESETVALUE        0x00000000   /**< \brief (TWIS_HSTR reset_value) HS-mode Timing Register */

#define TWIS_HSTR_HDDAT_Pos         16           /**< \brief (TWIS_HSTR) Data Hold Cycles */
#define TWIS_HSTR_HDDAT_Msk         (0xFFu << TWIS_HSTR_HDDAT_Pos)
#define TWIS_HSTR_HDDAT(value)      ((TWIS_HSTR_HDDAT_Msk & ((value) << TWIS_HSTR_HDDAT_Pos)))
#define TWIS_HSTR_MASK              0x00FF0000u  /**< \brief (TWIS_HSTR) MASK Register */

/* -------- TWIS_SRR : (TWIS Offset: 0x38) (R/W 32) Slew Rate Register -------- */
#define TWIS_SRR_OFFSET             0x38         /**< \brief (TWIS_SRR offset) Slew Rate Register */
#define TWIS_SRR_RESETVALUE         0x00000000   /**< \brief (TWIS_SRR reset_value) Slew Rate Register */

#define TWIS_SRR_DADRIVEL_Pos       0            /**< \brief (TWIS_SRR) Data Drive Strength LOW */
#define TWIS_SRR_DADRIVEL_Msk       (0x7u << TWIS_SRR_DADRIVEL_Pos)
#define TWIS_SRR_DADRIVEL(value)    ((TWIS_SRR_DADRIVEL_Msk & ((value) << TWIS_SRR_DADRIVEL_Pos)))
#define TWIS_SRR_DASLEW_Pos         8            /**< \brief (TWIS_SRR) Data Slew Limit */
#define TWIS_SRR_DASLEW_Msk         (0x3u << TWIS_SRR_DASLEW_Pos)
#define TWIS_SRR_DASLEW(value)      ((TWIS_SRR_DASLEW_Msk & ((value) << TWIS_SRR_DASLEW_Pos)))
#define TWIS_SRR_FILTER_Pos         28           /**< \brief (TWIS_SRR) Input Spike Filter Control */
#define TWIS_SRR_FILTER_Msk         (0x3u << TWIS_SRR_FILTER_Pos)
#define TWIS_SRR_FILTER(value)      ((TWIS_SRR_FILTER_Msk & ((value) << TWIS_SRR_FILTER_Pos)))
#define TWIS_SRR_MASK               0x30000307u  /**< \brief (TWIS_SRR) MASK Register */

/* -------- TWIS_HSSRR : (TWIS Offset: 0x3C) (R/W 32) HS-mode Slew Rate Register -------- */
#define TWIS_HSSRR_OFFSET           0x3C         /**< \brief (TWIS_HSSRR offset) HS-mode Slew Rate Register */
#define TWIS_HSSRR_RESETVALUE       0x00000000   /**< \brief (TWIS_HSSRR reset_value) HS-mode Slew Rate Register */

#define TWIS_HSSRR_DADRIVEL_Pos     0            /**< \brief (TWIS_HSSRR) Data Drive Strength LOW */
#define TWIS_HSSRR_DADRIVEL_Msk     (0x7u << TWIS_HSSRR_DADRIVEL_Pos)
#define TWIS_HSSRR_DADRIVEL(value)  ((TWIS_HSSRR_DADRIVEL_Msk & ((value) << TWIS_HSSRR_DADRIVEL_Pos)))
#define TWIS_HSSRR_DASLEW_Pos       8            /**< \brief (TWIS_HSSRR) Data Slew Limit */
#define TWIS_HSSRR_DASLEW_Msk       (0x3u << TWIS_HSSRR_DASLEW_Pos)
#define TWIS_HSSRR_DASLEW(value)    ((TWIS_HSSRR_DASLEW_Msk & ((value) << TWIS_HSSRR_DASLEW_Pos)))
#define TWIS_HSSRR_FILTER_Pos       28           /**< \brief (TWIS_HSSRR) Input Spike Filter Control */
#define TWIS_HSSRR_FILTER_Msk       (0x3u << TWIS_HSSRR_FILTER_Pos)
#define TWIS_HSSRR_FILTER(value)    ((TWIS_HSSRR_FILTER_Msk & ((value) << TWIS_HSSRR_FILTER_Pos)))
#define TWIS_HSSRR_MASK             0x30000307u  /**< \brief (TWIS_HSSRR) MASK Register */

/** \brief TWIS hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  RwReg   TWIS_CR;            /**< \brief (TWIS Offset: 0x00) Control Register */
  RwReg   TWIS_NBYTES;        /**< \brief (TWIS Offset: 0x04) NBYTES Register */
  RwReg   TWIS_TR;            /**< \brief (TWIS Offset: 0x08) Timing Register */
  RoReg   TWIS_RHR;           /**< \brief (TWIS Offset: 0x0C) Receive Holding Register */
  WoReg   TWIS_THR;           /**< \brief (TWIS Offset: 0x10) Transmit Holding Register */
  RoReg   TWIS_PECR;          /**< \brief (TWIS Offset: 0x14) Packet Error Check Register */
  RoReg   TWIS_SR;            /**< \brief (TWIS Offset: 0x18) Status Register */
  WoReg   TWIS_IER;           /**< \brief (TWIS Offset: 0x1C) Interrupt Enable Register */
  WoReg   TWIS_IDR;           /**< \brief (TWIS Offset: 0x20) Interrupt Disable Register */
  RoReg   TWIS_IMR;           /**< \brief (TWIS Offset: 0x24) Interrupt Mask Register */
  WoReg   TWIS_SCR;           /**< \brief (TWIS Offset: 0x28) Status Clear Register */
  RoReg   TWIS_PR;            /**< \brief (TWIS Offset: 0x2C) Parameter Register */
  RoReg   TWIS_VR;            /**< \brief (TWIS Offset: 0x30) Version Register */
  RwReg   TWIS_HSTR;          /**< \brief (TWIS Offset: 0x34) HS-mode Timing Register */
  RwReg   TWIS_SRR;           /**< \brief (TWIS Offset: 0x38) Slew Rate Register */
  RwReg   TWIS_HSSRR;         /**< \brief (TWIS Offset: 0x3C) HS-mode Slew Rate Register */
} Twis;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_TWIS_COMPONENT_ */
